[
    {
      "estate_title": "Modern Single-Family Home with Stunning Views",
      "id": 1,
      "segment_name": "Single-family homes",
      "description": "Perched atop a gentle hillside, this modern single-family home offers a harmonious blend of sleek design and breathtaking natural surroundings. Floor-to-ceiling windows frame panoramic vistas of rolling hills, verdant forests, and perhaps even distant mountains, inviting the beauty of the outdoors to seamlessly merge with the comfort of indoor living.The exterior facade boasts clean lines and a minimalist aesthetic, with a combination of wood, glass, and stone materials lending an air of contemporary sophistication. A spacious deck or patio extends from the main living .",
      "price": "$950,000",
      "status": "sale",
      "area": "3,500 sq ft",
      "location": "1234 Oak Street, Cityville",
      "facilities": ["living room", "swimming pool", "kitchen"],
      "image": "https://i.ibb.co/dtsc4yH/ghue.webp"
    },
    {
      "estate_title": "Luxurious Townhouse in Historic District",
      "id": 2,
      "segment_name": "Townhouses",
      "description": "Nestled within the charming streets of a historic district lies a luxurious townhouse, an epitome of elegance and sophistication. This architectural gem offers a blend of timeless charm and modern comfort, showcasing exquisite craftsmanship at every turn. With spacious living areas adorned with intricate detailing, the townhouse invites relaxation and indulgence. Its gourmet kitchen, equipped with state-of-the-art appliances, is a haven for culinary enthusiasts. Upstairs, sumptuous bedrooms promise restful nights, while opulent bathrooms boast lavish amenities.",
      "price": "$750,000",
      "status": "sale",
      "area": "2,200 sq ft",
      "location": "567 Maple Avenue, Townsville",
      "facilities": ["living room", "kitchen", "courtyard"],
      "image": "https://i.ibb.co/C6BpQBm/terrah-holly-pmhdkg-RCbt-E-unsplash-1.jpg"
    },
    {
      "estate_title": "Modern Urban Apartment with City Views",
      "id": 3,
      "segment_name": "Apartments",
      "description": "Perched high in the urban skyline, this modern apartment offers unparalleled city views that redefine contemporary living. Floor-to-ceiling windows flood the space with natural light, illuminating sleek, minimalist design elements. The open-concept layout seamlessly blends living, dining, and kitchen areas, perfect for entertaining or unwinding in style. Admire the cityscape from your private balcony, a serene oasis amidst the vibrant energy of the metropolis below. Retreat to luxurious bedrooms where comfort meets sophistication, and wake up to the sun rising over the skyline. Immerse yourself in the cosmopolitan allure of urban living in this extraordinary apartment with a view.",
      "price": "$3,000/month",
      "status": "rent",
      "area": "1,000 sq ft",
      "location": "789 Pine Street, Metropolis",
      "facilities": ["living room", "rooftop terrace", "gym"],
      "image": "https://i.ibb.co/CsWTqJQ/luke-van-zyl-ko-H7-IVuw-RLw-unsplash.jpg"
    },
    {
      "estate_title": "Student Housing Near University Campus",
      "id": 4,
      "segment_name": "Student housing",
      "description": "Discover the ideal blend of convenience and comfort in our student housing just steps away from the university campus. Designed with the modern student in mind, our accommodations offer a welcoming atmosphere and all the amenities you need for academic success. Spacious bedrooms provide a peaceful retreat for studying and relaxation, while communal areas foster a sense of community and connection among residents. With easy access to campus facilities and nearby amenities, you'll spend less time commuting and more time focusing on your studies and extracurricular pursuits. Experience the convenience of living close to campus in our student housing, where academic excellence meets comfort and convenience.",
      "price": "$800/month per room",
      "status": "rent",
      "area": "600 sq ft (per room)",
      "location": "101 College Avenue, Collegeland",
      "facilities": ["living room", "study area", "laundry room"],
      "image": "https://i.ibb.co/82zFvkp/gpg-1.webp"
    },
    {
      "estate_title": "Senior Living Community with Resort Amenities",
      "id": 5,
      "segment_name": "Senior living communities",
      "description": "Welcome to our senior living community, where luxury meets tranquility in a resort-style setting. Nestled amidst lush landscapes, our community offers a range of amenities designed to enhance every aspect of your retirement lifestyle. Dive into relaxation at our sparkling pool or unwind in our rejuvenating spa. Stay active and healthy with our fitness center and walking trails, perfect for maintaining your well-being. Indulge in gourmet dining experiences prepared by our culinary team, or socialize with friends in our elegant clubhouse. With a calendar full of engaging activities and events, every day holds the promise of new adventures and lasting memories. Experience retirement living at its finest in our senior community, where resort amenities await your enjoyment.",
      "price": "$4,500/month",
      "status": "rent",
      "area": "1,200 sq ft",
      "location": "222 Sunset Boulevard, Serenity Village",
      "facilities": ["living room", "clubhouse", "fitness center"],
      "image": "https://i.ibb.co/RNwP0YW/gus-ruballo-h5-QNcl-JUi-A8-unsplash.jpg"
    },
    {
      "estate_title": "Beachfront Vacation Rental with Private Beach Access",
      "id": 6,
      "segment_name": "Vacation rentals",
      "description": "Escape to paradise with our beachfront vacation rental offering exclusive access to a pristine stretch of sandy shores. Nestled along the coastline, this luxurious retreat provides the ultimate seaside getaway for you and your loved ones. Step outside onto your private balcony to savor breathtaking ocean views and gentle sea breezes. Take leisurely strolls along the secluded beach or lounge beneath the sun-kissed sky with toes dipped in the warm sands. Inside, the spacious accommodations exude coastal charm and comfort, with modern amenities to ensure a relaxing stay. Whether you're seeking adventure on the water or serenity by the shore, this beachfront rental promises an unforgettable vacation experience in paradise.",
      "price": "$300/night",
      "status": "rent",
      "area": "1,800 sq ft",
      "location": "444 Ocean Drive, Seaside Haven",
      "facilities": ["living room", "private beach access", "patio"],
      "image": "https://i.ibb.co/zfVRNkN/Screenshot-2024-04-12-212919.png"
    },
    {
      "estate_title": "Charming Family Home with Garden Oasis",
      "id": 7,
      "segment_name": "Single-family homes",
      "description": "Welcome to our charming family home, where a garden oasis awaits to enchant and delight. Tucked away in a tranquil neighborhood, this residence offers a perfect blend of warmth, comfort, and outdoor beauty. Step through the front door into a cozy living space adorned with characterful touches and inviting ambiance. The heart of the home, the garden oasis, beckons with lush greenery, colorful blooms, and serene seating areas for relaxation and outdoor gatherings. Children can frolic on the verdant lawn while parents unwind amidst the natural splendor. Inside, the well-appointed rooms provide ample space for family activities and restful nights. Experience the joy of family living surrounded by the beauty of nature in our charming home with a garden oasis.",
      "price": "$650,000",
      "status": "sale",
      "area": "2,000 sq ft",
      "location": "555 Elm Street, Garden Grove",
      "facilities": ["living room", "garden", "patio"],
      "image": "https://i.ibb.co/7vS532F/aab.jpg"
    },
    {
      "estate_title": "Cozy Townhouse in Quaint Suburb",
      "id": 8,
      "segment_name": "Townhouses",
      "description": "Discover the epitome of cozy living in our charming townhouse nestled within a quaint suburb. Set against a backdrop of tree-lined streets and friendly neighbors, this inviting residence exudes warmth and comfort at every turn. Step inside to find a welcoming living space, adorned with soft hues and plush furnishings, perfect for relaxation and intimate gatherings. The kitchen, bathed in natural light, invites culinary adventures with its modern amenities and cozy dining area. Upstairs, tranquil bedrooms promise peaceful nights and rejuvenating sleep. Outside, a private patio offers a serene retreat, ideal for morning coffee or evening stargazing. Experience the serenity of suburban life in our cozy townhouse, where comfort and charm await.",
      "price": "$500,000",
      "status": "sale",
      "area": "1,600 sq ft",
      "location": "777 Willow Lane, Suburbia",
      "facilities": ["living room", "kitchen", "backyard"],
      "image": "https://i.ibb.co/sQ8Z0MD/istockphoto-1415886888-612x612.jpg"
    },
    {
      "estate_title": "Spacious Apartment in Trendy Neighborhood",
      "id": 9,
      "segment_name": "Apartments",
      "description": " Embrace the vibrant energy of city living in our spacious apartment nestled within a trendy neighborhood. Boasting contemporary style and ample room to roam, this residence offers the perfect blend of urban sophistication and comfort. Step inside to discover expansive living areas bathed in natural light, adorned with sleek finishes and modern accents. The open-concept layout seamlessly connects the living, dining, and kitchen spaces, creating an ideal setting for entertaining or relaxing in style. With trendy cafes, boutiques, and cultural hotspots just steps away, every day presents new opportunities for exploration and excitement.",
      "price": "$2,200/month",
      "status": "rent",
      "area": "1,400 sq ft",
      "location": "888 Main Street, Hipsterville",
      "facilities": ["living room", "balcony", "storage"],
      "image": "https://i.ibb.co/2jJThCt/aertert-cwkre.webp"
    }
  ]
  